In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
left1 = pd.DataFrame({'key':['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})

In [7]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index= ['a', 'b'])

In [8]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [9]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [11]:
lefth = pd.DataFrame({'key1': ['ohio', 'ohio', 'ohio', 'neveda','nevada'],
                      'key2':[2000, 2001, 2002, 2001, 2002],'data':np.arange(5.)})

In [12]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)), index=[['nevada', 'nevada', 'ohio', 'ohio', 'ohio', 'ohio'],
                                                           [2001, 2000, 2000, 2000, 2001, 2002]],
                     columns=['event1', 'event2'])

In [13]:
lefth

     key1  key2  data
0    ohio  2000   0.0
1    ohio  2001   1.0
2    ohio  2002   2.0
3  neveda  2001   3.0
4  nevada  2002   4.0

In [14]:
righth

             event1  event2
nevada 2001       0       1
       2000       2       3
ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [16]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

   key1  key2  data  event1  event2
0  ohio  2000   0.0       4       5
0  ohio  2000   0.0       6       7
1  ohio  2001   1.0       8       9
2  ohio  2002   2.0      10      11

In [17]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    ohio  2000   0.0     4.0     5.0
0    ohio  2000   0.0     6.0     7.0
1    ohio  2001   1.0     8.0     9.0
2    ohio  2002   2.0    10.0    11.0
3  neveda  2001   3.0     NaN     NaN
4  nevada  2002   4.0     NaN     NaN
4  nevada  2001   NaN     0.0     1.0
4  nevada  2000   NaN     2.0     3.0

In [18]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5.,6.]], index=['a', 'c', 'e'], columns=['ohio', 'nevada'])

In [20]:
right2 = pd.DataFrame([[7., 8], [9., 10], [11., 12],[13., 14]], index=['b', 'c', 'd' ,'e'], columns=['missouri', 'alabama'])

In [21]:
left2

   ohio  nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [22]:
right2

   missouri  alabama
b       7.0        8
c       9.0       10
d      11.0       12
e      13.0       14

In [23]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   ohio  nevada  missouri  alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [24]:
left2.join(right2, how='outer')

   ohio  nevada  missouri  alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [25]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [26]:
another = pd.DataFrame([[7., 8], [9., 10], [11., 12],[13., 14]], index=['a', 'c', 'e', 'f'], columns=['newyork', 'oregon'])

In [27]:
left2.join([right2, another])

   ohio  nevada  missouri  alabama  newyork  oregon
a   1.0     2.0       NaN      NaN      7.0     8.0
c   3.0     4.0       9.0     10.0      9.0    10.0
e   5.0     6.0      13.0     14.0     11.0    12.0

In [28]:
left2.join([right2, another], how='outer')

   ohio  nevada  missouri  alabama  newyork  oregon
a   1.0     2.0       NaN      NaN      7.0     8.0
c   3.0     4.0       9.0     10.0      9.0    10.0
e   5.0     6.0      13.0     14.0     11.0    12.0
b   NaN     NaN       7.0      8.0      NaN     NaN
d   NaN     NaN      11.0     12.0      NaN     NaN
f   NaN     NaN       NaN      NaN     13.0    14.0

In [29]:
arr = np.arange(12).reshape((3, 4))

In [30]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [31]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [35]:
s1 = pd.Series([0, 1], index=['a', 'b'])

s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

s3 = pd.Series([5, 6], index=['f', 'g'])

In [36]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [37]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [38]:
s4 = pd.concat([s1, s3])

In [39]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [40]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [41]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [45]:
result = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

In [46]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [47]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [48]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [49]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])

In [50]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])

In [51]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [53]:
pd.concat({'level1':df1, 'level2':df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [54]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'], names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [56]:
df1 = pd.DataFrame(np.random.randn(3,4), columns=['a', 'b', 'c', 'd'])

In [ ]:
df1 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])